wodecoin/mm32f5270_nano_frame/base/library/MM32F5270/Include/reg_i2c.h
/**
  * @brief I2C_ENR Register Bit Definition
  */
#define  I2C_ENR_ENABLE_Pos                       (0)
#define  I2C_ENR_ENABLE_Msk                       (0x01U << I2C_ENR_ENABLE_Pos)       /*!<*/
#define  I2C_ENR_ABORT_Pos                        (1)
#define  I2C_ENR_ABORT_Msk                        (0x01U << I2C_ENR_ABORT_Pos)        /*!<*/
#define  I2C_ENR_TX_CMD_BLOCK_Pos                 (2)
#define  I2C_ENR_TX_CMD_BLOCK_Msk                 (0x01U << I2C_ENR_TX_CMD_BLOCK_Pos) /*!<*/
#define  I2C_ENR_SDA_RCV_EN_Pos                   (3)
#define  I2C_ENR_SDA_RCV_EN_Msk                   (0x01U << I2C_ENR_SDA_RCV_EN_Pos)   /*!<*/
#define  I2C_ENR_SMB_CLK_RST_Pos                  (16)
#define  I2C_ENR_SMB_CLK_RST_Msk                  (0x01U << I2C_ENR_SMB_CLK_RST_Pos)  /*!<*/
#define  I2C_ENR_SMB_ALT_EN_Pos                   (18)
#define  I2C_ENR_SMB_ALT_EN_Msk                   (0x01U << I2C_ENR_SMB_ALT_EN_Pos)   /*!<*/

/**
  * @brief I2C_SR Register Bit Definition
  */
#define  I2C_SR_ACTIV_Pos                         (0)
#define  I2C_SR_ACTIV_Msk                         (0x01U << I2C_SR_ACTIV_Pos)             /*!<*/
#define  I2C_SR_TFNF_Pos                          (1)
#define  I2C_SR_TFNF_Msk                          (0x01U << I2C_SR_TFNF_Pos)              /*!<*/
#define  I2C_SR_TFE_Pos                           (2)
#define  I2C_SR_TFE_Msk                           (0x01U << I2C_SR_TFE_Pos)               /*!<*/
#define  I2C_SR_RFNE_Pos                          (3)
#define  I2C_SR_RFNE_Msk                          (0x01U << I2C_SR_RFNE_Pos)              /*!<*/
#define  I2C_SR_RFF_Pos                           (4)
#define  I2C_SR_RFF_Msk                           (0x01U << I2C_SR_RFF_Pos)               /*!<*/
#define  I2C_SR_MST_ACTIV_Pos                     (5)
#define  I2C_SR_MST_ACTIV_Msk                     (0x01U << I2C_SR_MST_ACTIV_Pos)         /*!<*/
#define  I2C_SR_SLV_ACTIV_Pos                     (6)
#define  I2C_SR_SLV_ACTIV_Msk                     (0x01U << I2C_SR_SLV_ACTIV_Pos)         /*!<*/
#define  I2C_SR_MST_HOLD_TX_EMPTY_Pos             (7)
#define  I2C_SR_MST_HOLD_TX_EMPTY_Msk             (0x01U << I2C_SR_MST_HOLD_TX_EMPTY_Pos) /*!<*/
#define  I2C_SR_MST_HOLD_RX_FULL_Pos              (8)
#define  I2C_SR_MST_HOLD_RX_FULL_Msk              (0x01U << I2C_SR_MST_HOLD_RX_FULL_Pos)  /*!<*/
#define  I2C_SR_SLV_HOLD_TX_EMPTY_Pos             (9)
#define  I2C_SR_SLV_HOLD_TX_EMPTY_Msk             (0x01U << I2C_SR_SLV_HOLD_TX_EMPTY_Pos) /*!<*/
#define  I2C_SR_SLV_HOLD_RX_FULL_Pos              (10)
#define  I2C_SR_SLV_HOLD_RX_FULL_Msk              (0x01U << I2C_SR_SLV_HOLD_RX_FULL_Pos)  /*!<*/
#define  I2C_SR_SDA_NOT_RECOVERED_Pos             (11)
#define  I2C_SR_SDA_NOT_RECOVERED_Msk             (0x01U << I2C_SR_SDA_NOT_RECOVERED_Pos) /*!<*/
#define  I2C_SR_SMB_QC_Pos                        (16)
#define  I2C_SR_SMB_QC_Msk                        (0x01U << I2C_SR_SMB_QC_Pos)            /*!<*/
#define  I2C_SR_SMB_SLV_AV_Pos                    (17)
#define  I2C_SR_SMB_SLV_AV_Msk                    (0x01U << I2C_SR_SMB_SLV_AV_Pos)        /*!<*/
#define  I2C_SR_SMB_SLV_AR_Pos                    (18)
#define  I2C_SR_SMB_SLV_AR_Msk                    (0x01U << I2C_SR_SMB_SLV_AR_Pos)        /*!<*/
#define  I2C_SR_SMB_ALT_Pos                       (20)
#define  I2C_SR_SMB_ALT_Msk                       (0x01U << I2C_SR_SMB_ALT_Pos)           /*!<*/

/**
  * @brief I2C_TXFLR Register Bit Definition
  */
#define  I2C_TXFLR_CNT_Pos                        (0)
#define  I2C_TXFLR_CNT_Msk                        (0x07U << I2C_TXFLR_CNT_Pos) /*!<*/

/**
  * @brief I2C_RXFLR Register Bit Definition
  */
#define  I2C_RXFLR_CNT_Pos                        (0)
#define  I2C_RXFLR_CNT_Msk                        (0x07U << I2C_RXFLR_CNT_Pos) /*!<*/

/**
  * @brief I2C_HOLD Register Bit Definition
  */
#define  I2C_HOLD_TX_HOLD_Pos                     (0)
#define  I2C_HOLD_TX_HOLD_Msk                     (0xFFFFU << I2C_HOLD_TX_HOLD_Pos) /*!<*/
#define  I2C_HOLD_RX_HOLD_Pos                     (16)
#define  I2C_HOLD_RX_HOLD_Msk                     (0xFFU << I2C_HOLD_RX_HOLD_Pos)   /*!<*/

/**
  * @brief I2C_TX_ABRT_SRC Register Bit Definition
  */
#define  I2C_TX_ABRT_SRC_7ADDR_NOACK_Pos          (0)
#define  I2C_TX_ABRT_SRC_7ADDR_NOACK_Msk          (0x01U << I2C_TX_ABRT_SRC_7ADDR_NOACK_Pos)     /*!<*/
#define  I2C_TX_ABRT_SRC_10ADDR1_NOACK_Pos        (1)
#define  I2C_TX_ABRT_SRC_10ADDR1_NOACK_Msk        (0x01U << I2C_TX_ABRT_SRC_10ADDR1_NOACK_Pos)   /*!<*/
#define  I2C_TX_ABRT_SRC_10ADDR2_NOACK_Pos        (2)
#define  I2C_TX_ABRT_SRC_10ADDR2_NOACK_Msk        (0x01U << I2C_TX_ABRT_SRC_10ADDR2_NOACK_Pos)   /*!<*/
#define  I2C_TX_ABRT_SRC_TXDATA_NOACK_Pos         (3)
#define  I2C_TX_ABRT_SRC_TXDATA_NOACK_Msk         (0x01U << I2C_TX_ABRT_SRC_TXDATA_NOACK_Pos)    /*!<*/
#define  I2C_TX_ABRT_SRC_GC_NOACK_Pos             (4)
#define  I2C_TX_ABRT_SRC_GC_NOACK_Msk             (0x01U << I2C_TX_ABRT_SRC_GC_NOACK_Pos)        /*!<*/
#define  I2C_TX_ABRT_SRC_GC_READ_Pos              (5)
#define  I2C_TX_ABRT_SRC_GC_READ_Msk              (0x01U << I2C_TX_ABRT_SRC_GC_READ_Pos)         /*!<*/
#define  I2C_TX_ABRT_SRC_SBYTE_ACKDET_Pos         (7)
#define  I2C_TX_ABRT_SRC_SBYTE_ACKDET_Msk         (0x01U << I2C_TX_ABRT_SRC_SBYTE_ACKDET_Pos)    /*!<*/
#define  I2C_TX_ABRT_SRC_SBYTE_NORSTRT_Pos        (9)
#define  I2C_TX_ABRT_SRC_SBYTE_NORSTRT_Msk        (0x01U << I2C_TX_ABRT_SRC_SBYTE_NORSTRT_Pos)   /*!<*/
#define  I2C_TX_ABRT_SRC_10B_RD_NORSTRT_Pos       (10)
#define  I2C_TX_ABRT_SRC_10B_RD_NORSTRT_Msk       (0x01U << I2C_TX_ABRT_SRC_10B_RD_NORSTRT_Pos)  /*!<*/
#define  I2C_TX_ABRT_SRC_MST_DIS_Pos              (11)
#define  I2C_TX_ABRT_SRC_MST_DIS_Msk              (0x01U << I2C_TX_ABRT_SRC_MST_DIS_Pos)         /*!<*/
#define  I2C_TX_ABRT_SRC_LOST_Pos                 (12)
#define  I2C_TX_ABRT_SRC_LOST_Msk                 (0x01U << I2C_TX_ABRT_SRC_LOST_Pos)            /*!<*/
#define  I2C_TX_ABRT_SRC_SLVFLUSH_TXFIFO_Pos      (13)
#define  I2C_TX_ABRT_SRC_SLVFLUSH_TXFIFO_Msk      (0x01U << I2C_TX_ABRT_SRC_SLVFLUSH_TXFIFO_Pos) /*!<*/
#define  I2C_TX_ABRT_SRC_SLV_ARBLOST_Pos          (14)
#define  I2C_TX_ABRT_SRC_SLV_ARBLOST_Msk          (0x01U << I2C_TX_ABRT_SRC_SLV_ARBLOST_Pos)     /*!<*/
#define  I2C_TX_ABRT_SRC_SLVRD_INTX_Pos           (15)
#define  I2C_TX_ABRT_SRC_SLVRD_INTX_Msk           (0x01U << I2C_TX_ABRT_SRC_SLVRD_INTX_Pos)      /*!<*/
#define  I2C_TX_ABRT_SRC_USER_ABRT_Pos            (16)
#define  I2C_TX_ABRT_SRC_USER_ABRT_Msk            (0x01U << I2C_TX_ABRT_SRC_USER_ABRT_Pos)       /*!<*/
#define  I2C_TX_ABRT_SRC_SDA_LOW_Pos              (17)
#define  I2C_TX_ABRT_SRC_SDA_LOW_Msk              (0x01U << I2C_TX_ABRT_SRC_SDA_LOW_Pos)         /*!<*/
#define  I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Pos         (23)
#define  I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Msk         (0x01FFU << I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Pos)  /*!<*/

/**
  * @brief I2C_SLV_NACK Register Bit Definition
  */
#define  I2C_SLV_NACK_NACK_Pos                    (0)
#define  I2C_SLV_NACK_NACK_Msk                    (0x01U << I2C_SLV_NACK_NACK_Pos) /*!<*/

/**
  * @brief I2C_DMA Register Bit Definition
  */
#define  I2C_DMA_RXEN_Pos                         (0)
#define  I2C_DMA_RXEN_Msk                         (0x01U << I2C_DMA_RXEN_Pos) /*!<*/
#define  I2C_DMA_TXEN_Pos                         (1)
#define  I2C_DMA_TXEN_Msk                         (0x01U << I2C_DMA_TXEN_Pos) /*!<*/

/**
  * @brief I2C_SETUP Register Bit Definition
  */
#define  I2C_SETUP_CNT_Pos                        (0)
#define  I2C_SETUP_CNT_Msk                        (0xFFU << I2C_SETUP_CNT_Pos) /*!<*/

/**
  * @brief I2C_GCR Register Bit Definition
  */
#define  I2C_GCR_GC_Pos                           (0)
#define  I2C_GCR_GC_Msk                           (0x01U << I2C_GCR_GC_Pos) /*!<*/

/**
  * @brief I2C_EN_SR Register Bit Definition
  */
#define  I2C_EN_SR_IC_EN_Pos                      (0)
#define  I2C_EN_SR_IC_EN_Msk                      (0x01U << I2C_EN_SR_IC_EN_Pos)              /*!<*/
#define  I2C_EN_SR_SLV_DIS_WHILE_BUSY_Pos         (1)
#define  I2C_EN_SR_SLV_DIS_WHILE_BUSY_Msk         (0x01U << I2C_EN_SR_SLV_DIS_WHILE_BUSY_Pos) /*!<*/
#define  I2C_EN_SR_SLV_RX_DATA_LOST_Pos           (2)
#define  I2C_EN_SR_SLV_RX_DATA_LOST_Msk           (0x01U << I2C_EN_SR_SLV_RX_DATA_LOST_Pos)   /*!<*/

/**
  * @brief I2C_SPKLEN Register Bit Definition
  */
#define  I2C_SPKLEN_SPKLEN_Pos                    (0)
#define  I2C_SPKLEN_SPKLEN_Msk                    (0xFFU << I2C_SPKLEN_SPKLEN_Pos) /*!<*/

/**
  * @brief I2C_SCL_TMO Register Bit Definition
  */
#define  I2C_SCL_TMO_SCL_TIMEOUT_Pos              (0)
#define  I2C_SCL_TMO_SCL_TIMEOUT_Msk              (0xFFFFFFFFU << I2C_SCL_TMO_SCL_TIMEOUT_Pos) /*!<*/

/**
  * @brief I2C_SDA_TMO Register Bit Definition
  */
#define  I2C_SDA_TMO_SDA_TIMEOUT_Pos              (0)
#define  I2C_SDA_TMO_SDA_TIMEOUT_Msk              (0xFFFFFFFFU << I2C_SDA_TMO_SDA_TIMEOUT_Pos) /*!<*/

/**
  * @brief I2C_SCL_STUCK Register Bit Definition
  */
#define  I2C_SCL_STUCK_SCL_STUCK_Pos              (0)
#define  I2C_SCL_STUCK_SCL_STUCK_Msk              (0x01U << I2C_SCL_STUCK_SCL_STUCK_Pos) /*!<*/

/**
  * @brief I2C_SMB_SEXT Register Bit Definition
  */
#define  I2C_SMB_SEXT_SMB_SEXT_Pos                (0)
#define  I2C_SMB_SEXT_SMB_SEXT_Msk                (0xFFFFFFFFU << I2C_SMB_SEXT_SMB_SEXT_Pos) /*!<*/

/**
  * @brief I2C_SMB_MEXT Register Bit Definition
  */
#define  I2C_SMB_MEXT_SMB_MEXT_Pos                (0)
#define  I2C_SMB_MEXT_SMB_MEXT_Msk                (0xFFFFFFFFU << I2C_SMB_MEXT_SMB_MEXT_Pos) /*!<*/

/**
  * @brief I2C_SMB_IDLE Register Bit Definition
  */
#define  I2C_SMB_IDLE_SMB_IDLE_CNT_Pos            (0)
#define  I2C_SMB_IDLE_SMB_IDLE_CNT_Msk            (0xFFFFU << I2C_SMB_IDLE_SMB_IDLE_CNT_Pos) /*!<*/

/**
  * @brief I2C_SMB_ISR Register Bit Definition
  */
#define  I2C_SMB_ISR_R_SLV_TMO_Pos                (0)
#define  I2C_SMB_ISR_R_SLV_TMO_Msk                (0x01U << I2C_SMB_ISR_R_SLV_TMO_Pos)    /*!<*/
#define  I2C_SMB_ISR_R_MST_TMO_Pos                (1)
#define  I2C_SMB_ISR_R_MST_TMO_Msk                (0x01U << I2C_SMB_ISR_R_MST_TMO_Pos)    /*!<*/
#define  I2C_SMB_ISR_R_ARP_QUICK_Pos              (2)
#define  I2C_SMB_ISR_R_ARP_QUICK_Msk              (0x01U << I2C_SMB_ISR_R_ARP_QUICK_Pos)  /*!<*/
#define  I2C_SMB_ISR_R_ARP_NOTIFY_Pos             (3)
#define  I2C_SMB_ISR_R_ARP_NOTIFY_Msk             (0x01U << I2C_SMB_ISR_R_ARP_NOTIFY_Pos) /*!<*/
#define  I2C_SMB_ISR_R_ARP_PRE_Pos                (4)
#define  I2C_SMB_ISR_R_ARP_PRE_Msk                (0x01U << I2C_SMB_ISR_R_ARP_PRE_Pos)    /*!<*/
#define  I2C_SMB_ISR_R_ARP_RST_Pos                (5)
#define  I2C_SMB_ISR_R_ARP_RST_Msk                (0x01U << I2C_SMB_ISR_R_ARP_RST_Pos)    /*!<*/
#define  I2C_SMB_ISR_R_ARP_UDID_Pos               (6)
#define  I2C_SMB_ISR_R_ARP_UDID_Msk               (0x01U << I2C_SMB_ISR_R_ARP_UDID_Pos)   /*!<*/
#define  I2C_SMB_ISR_R_ARP_ASSGN_Pos              (7)
#define  I2C_SMB_ISR_R_ARP_ASSGN_Msk              (0x01U << I2C_SMB_ISR_R_ARP_ASSGN_Pos)  /*!<*/
#define  I2C_SMB_ISR_R_PEC_NACK_Pos               (8)
#define  I2C_SMB_ISR_R_PEC_NACK_Msk               (0x01U << I2C_SMB_ISR_R_PEC_NACK_Pos)   /*!<*/
#define  I2C_SMB_ISR_R_SMB_ALT_Pos                (10)
#define  I2C_SMB_ISR_R_SMB_ALT_Msk                (0x01U << I2C_SMB_ISR_R_SMB_ALT_Pos)    /*!<*/

/**
  * @brief I2C_SMB_IMR Register Bit Definition
  */
#define  I2C_SMB_IMR_M_SLV_TMO_Pos                (0)
#define  I2C_SMB_IMR_M_SLV_TMO_Msk                (0x01U << I2C_SMB_IMR_M_SLV_TMO_Pos)    /*!<*/
#define  I2C_SMB_IMR_M_MST_TMO_Pos                (1)
#define  I2C_SMB_IMR_M_MST_TMO_Msk                (0x01U << I2C_SMB_IMR_M_MST_TMO_Pos)    /*!<*/
#define  I2C_SMB_IMR_M_ARP_QUICK_Pos              (2)
#define  I2C_SMB_IMR_M_ARP_QUICK_Msk              (0x01U << I2C_SMB_IMR_M_ARP_QUICK_Pos)  /*!<*/
#define  I2C_SMB_IMR_M_ARP_NOTIFY_Pos             (3)
#define  I2C_SMB_IMR_M_ARP_NOTIFY_Msk             (0x01U << I2C_SMB_IMR_M_ARP_NOTIFY_Pos) /*!<*/
#define  I2C_SMB_IMR_M_ARP_PRE_Pos                (4)
#define  I2C_SMB_IMR_M_ARP_PRE_Msk                (0x01U << I2C_SMB_IMR_M_ARP_PRE_Pos)    /*!<*/
#define  I2C_SMB_IMR_M_ARP_RST_Pos                (5)
#define  I2C_SMB_IMR_M_ARP_RST_Msk                (0x01U << I2C_SMB_IMR_M_ARP_RST_Pos)    /*!<*/
#define  I2C_SMB_IMR_M_ARP_UDID_Pos               (6)
#define  I2C_SMB_IMR_M_ARP_UDID_Msk               (0x01U << I2C_SMB_IMR_M_ARP_UDID_Pos)   /*!<*/
#define  I2C_SMB_IMR_M_ARP_ASSGN_Pos              (7)
#define  I2C_SMB_IMR_M_ARP_ASSGN_Msk              (0x01U << I2C_SMB_IMR_M_ARP_ASSGN_Pos)  /*!<*/
#define  I2C_SMB_IMR_M_PEC_NACK_Pos               (8)
#define  I2C_SMB_IMR_M_PEC_NACK_Msk               (0x01U << I2C_SMB_IMR_M_PEC_NACK_Pos)   /*!<*/
#define  I2C_SMB_IMR_M_SMB_ALT_Pos                (10)
#define  I2C_SMB_IMR_M_SMB_ALT_Msk                (0x01U << I2C_SMB_IMR_M_SMB_ALT_Pos)    /*!<*/

/**
  * @brief I2C_SMB_RAWISR Register Bit Definition
  */
#define  I2C_SMB_RAWISR_SLV_TMO_Pos               (0)
#define  I2C_SMB_RAWISR_SLV_TMO_Msk               (0x01U << I2C_SMB_RAWISR_SLV_TMO_Pos)    /*!<*/
#define  I2C_SMB_RAWISR_MST_TMO_Pos               (1)
#define  I2C_SMB_RAWISR_MST_TMO_Msk               (0x01U << I2C_SMB_RAWISR_MST_TMO_Pos)    /*!<*/
#define  I2C_SMB_RAWISR_ARP_QUICK_Pos             (2)
#define  I2C_SMB_RAWISR_ARP_QUICK_Msk             (0x01U << I2C_SMB_RAWISR_ARP_QUICK_Pos)  /*!<*/
#define  I2C_SMB_RAWISR_ARP_NOTIFY_Pos            (3)
#define  I2C_SMB_RAWISR_ARP_NOTIFY_Msk            (0x01U << I2C_SMB_RAWISR_ARP_NOTIFY_Pos) /*!<*/
#define  I2C_SMB_RAWISR_ARP_PRE_Pos               (4)
#define  I2C_SMB_RAWISR_ARP_PRE_Msk               (0x01U << I2C_SMB_RAWISR_ARP_PRE_Pos)    /*!<*/
#define  I2C_SMB_RAWISR_ARP_RST_Pos               (5)
#define  I2C_SMB_RAWISR_ARP_RST_Msk               (0x01U << I2C_SMB_RAWISR_ARP_RST_Pos)    /*!<*/
#define  I2C_SMB_RAWISR_ARP_UDID_Pos              (6)
#define  I2C_SMB_RAWISR_ARP_UDID_Msk              (0x01U << I2C_SMB_RAWISR_ARP_UDID_Pos)   /*!<*/
#define  I2C_SMB_RAWISR_ARP_ASSGN_Pos             (7)
#define  I2C_SMB_RAWISR_ARP_ASSGN_Msk             (0x01U << I2C_SMB_RAWISR_ARP_ASSGN_Pos)  /*!<*/
#define  I2C_SMB_RAWISR_PEC_NACK_Pos              (8)
#define  I2C_SMB_RAWISR_PEC_NACK_Msk              (0x01U << I2C_SMB_RAWISR_PEC_NACK_Pos)   /*!<*/
#define  I2C_SMB_RAWISR_SMB_ALT_Pos               (10)
#define  I2C_SMB_RAWISR_SMB_ALT_Msk               (0x01U << I2C_SMB_RAWISR_SMB_ALT_Pos)    /*!<*/

/**
  * @brief I2C_SMB_ICR Register Bit Definition
  */
#define  I2C_SMB_ICR_CLR_SLV_TMO_Pos              (0)
#define  I2C_SMB_ICR_CLR_SLV_TMO_Msk              (0x01U << I2C_SMB_ICR_CLR_SLV_TMO_Pos)    /*!<*/
#define  I2C_SMB_ICR_CLR_MST_TMO_Pos              (1)
#define  I2C_SMB_ICR_CLR_MST_TMO_Msk              (0x01U << I2C_SMB_ICR_CLR_MST_TMO_Pos)    /*!<*/
#define  I2C_SMB_ICR_CLR_ARP_QUICK_Pos            (2)
#define  I2C_SMB_ICR_CLR_ARP_QUICK_Msk            (0x01U << I2C_SMB_ICR_CLR_ARP_QUICK_Pos)  /*!<*/
#define  I2C_SMB_ICR_CLR_ARP_NOTIFY_Pos           (3)
#define  I2C_SMB_ICR_CLR_ARP_NOTIFY_Msk           (0x01U << I2C_SMB_ICR_CLR_ARP_NOTIFY_Pos) /*!<*/
#define  I2C_SMB_ICR_CLR_ARP_PRE_Pos              (4)
#define  I2C_SMB_ICR_CLR_ARP_PRE_Msk              (0x01U << I2C_SMB_ICR_CLR_ARP_PRE_Pos)    /*!<*/
#define  I2C_SMB_ICR_CLR_ARP_RST_Pos              (5)
#define  I2C_SMB_ICR_CLR_ARP_RST_Msk              (0x01U << I2C_SMB_ICR_CLR_ARP_RST_Pos)    /*!<*/
#define  I2C_SMB_ICR_CLR_ARP_UDID_Pos             (6)
#define  I2C_SMB_ICR_CLR_ARP_UDID_Msk             (0x01U << I2C_SMB_ICR_CLR_ARP_UDID_Pos)   /*!<*/
#define  I2C_SMB_ICR_CLR_ARP_ASSGN_Pos            (7)
#define  I2C_SMB_ICR_CLR_ARP_ASSGN_Msk            (0x01U << I2C_SMB_ICR_CLR_ARP_ASSGN_Pos)  /*!<*/
#define  I2C_SMB_ICR_CLR_PEC_NACK_Pos             (8)
#define  I2C_SMB_ICR_CLR_PEC_NACK_Msk             (0x01U << I2C_SMB_ICR_CLR_PEC_NACK_Pos)   /*!<*/
#define  I2C_SMB_ICR_CLR_SMB_ALT_Pos              (10)
#define  I2C_SMB_ICR_CLR_SMB_ALT_Msk              (0x01U << I2C_SMB_ICR_CLR_SMB_ALT_Pos)    /*!<*/

/**
  * @brief I2C_OPT_SAR Register Bit Definition
  */
#define  I2C_OPT_SAR_ADDR_Pos                     (0)
#define  I2C_OPT_SAR_ADDR_Msk                     (0x7FU << I2C_OPT_SAR_ADDR_Pos) /*!<*/

/**
  * @brief I2C_SMB_UDID_LSB Register Bit Definition
  */
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos        (0)
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Msk        (0xFFFFFFFFU << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) /*!<*/

/**
  * @brief I2C_SMB_UDID_MSB0 Register Bit Definition
  */
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos      (0)
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Msk      (0xFFFFFFFFU << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) /*!<*/

/**
  * @brief I2C_SMB_UDID_MSB1 Register Bit Definition
  */
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos      (0)
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Msk      (0xFFFFFFFFU << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) /*!<*/

/**
  * @brief I2C_SMB_UDID_MSB2 Register Bit Definition
  */
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos      (0)
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Msk      (0xFFFFFFFFU << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) /*!<*/

/**
  * @brief I2C_SLVMASK Register Bit Definition
  */
#define  I2C_SLVMASK_MASK_Pos                     (0)
#define  I2C_SLVMASK_MASK_Msk                     (0x03FFU << I2C_SLVMASK_MASK_Pos) /*!<*/

/**
  * @brief I2C_SLVRCVADDR Register Bit Definition
  */
#define  I2C_SLVRCVADDR_ADDR_Pos                  (0)
#define  I2C_SLVRCVADDR_ADDR_Msk                  (0x03FFU << I2C_SLVRCVADDR_ADDR_Pos) /*!<*/

#endif

